import React, { useContext } from "react";
import "./contract-pdf.css";
import { MainContext } from "../../../utils/context/context";
import {
  formatDate,
  formatmoney,
  getDayFromDate,
  getMonthName,
  getYearFromDate,
  numberToUzbekWords,
} from "../../../utils/functions";

export const ContractPDF = () => {
  const { shartnoma } = useContext(MainContext);

  if (!shartnoma) {
    window.location.assign("/contract-list");
  }

  console.log(shartnoma);

  return (
    <div className="ContractPDF">
      <div className="ContractPDF__list">
        <div className="ContractPDF__page">
          <div>
            <div className="page_num">-  1  -</div>
            <h1 className="ContractPDF__header">
              Кўп хонадонли турар-жой биноси қурилишига инвестиция ҳиссаси
            </h1>
            <h2 className="ContractPDF__title">ШАРТНОМАСИ № {shartnoma?.id}</h2>
            <div className="ContractPDF_head">
              <p>Каттакурғон тумани. </p>
              <p>{formatDate(shartnoma?.created_at, true)}</p>
            </div>
            <p className="ContractPDF__desc">
              ЎзР фуқароси <b>{shartnoma?.fullName}</b>, паспорт рақами{" "}
              <b>{shartnoma?.seria}</b>, <b>{shartnoma?.pass_ber_joy}</b> ТИИБ
              томонидан берилган, бундан кейин матнда “Инвестор” деб юритилади,
              бир томондан ва “ISHBEKOV STROI SERVICE” МЧЖ, бундан кейин матнда
              “Қурувчи” деб юритилади, Директори номидан Устав асосида иш
              юритувчи Т.И. Ишбеков, бошқа томондан, биргаликда “Томонлар”, якка
              ҳолда эса “Томон” деб юритилади, ўз хоҳиш-иродаси ва ўз
              манфаатларини кўзлаб ҳаракат қилиб, ушбу Шартномани қуйидагича
              туздилар:
            </p>
            <h2 className="ContractPDF__title">1. ШАРТНОМА ПРЕДМЕТИ</h2>
            <p className="ContractPDF__desc">
              1.1. "Қурувчи" ўз кучи билан ва (ёки) бошқа шахслар “STRONG
              FOUNDATIONS” МЧЖ Пудратчи ташкилотларни жалб қилган ҳолда
              қурилиш-монтаж ишларини бошлаш учун обектни рўйхатдан ўтказиш
              тўғрисидаги 04.04.2024 йилдаги 1-сон шартнома асосида Самарканд
              вилояти, Каттакургон тумани, Яккабог МФЙ, Иска қишоғи,1-уй
              манзилида жойлашган куп қаватли турар-жой (кейинги ўринларда
              "Турар-жой биноси" деб аталади) қуриш мажбуриятини олади ва
              Турар-жой биноси фойдаланишга топширилгандан сўнг ушбу шартномада
              белгиланган Инвестиция объектини "Инвесторга" топширади,
              "Инвестор" эса ушбу шартномада белгиланган тартибда ва муддатларда
              Турар-жой биносини қуришга инвестицияларни амалга ошириш ва
              Инвестиция объектини ўз мулкига қабул қилиш мажбуриятини олади.
              <br />
              <br />
              Турар-жой қуриш учун 3,5 гектар ер участкаси 06.06.2023 йилдаги
              YK-1718215/2267192-сонли кўчмас мулкка бўлган ҳуқуқларни давлат
              рўйхатидан ўтказиш тўғрисидаги Давлат реестридан кўчирма асосида
              ушбу ер участкасини ҳуқуқига эга. <br />
              <br /> 1.2. "Қурувчи" "ISHBEKOV STROI SERVICE" МЧЖ томонидан ишлаб
              чиқилган ва Ўзбекистон Республикаси Қурилиш вазирлиги ҳузуридаги
              Қурилиш соҳасида назорат инспекцияси томонидан
              5890-8665-27ed-5647-7077-5734-2801-сонли ва 97949-сонли хулосаси
              билан тасдиқланган лойиҳа-смета ҳужжатлари асосида турар-жой
              биноси қурилишини амалга оширади. <br />
              <br /> 1.3. Давлат қабул комиссияси томонидан турар-жой биносини
              тугатишнинг режалаштирилган муддати 2025- йилнинг III-чораги.
              <br />
              <br />
              1.4. Ушбу шартнома бўйича Инвестиция объекти лойиҳага мувофиқ
              қуйидаги хусусиятларга эга: <b>{shartnoma?.number_of_rooms}</b> (
              <b>{numberToUzbekWords(shartnoma?.number_of_rooms)} </b> ) хонали
              хонадон (жойлашуви: лифт билан, ўнгда/чап тарафда) Турар-жой
              биноси ( <b>Блок 1</b> ), <b>{shartnoma?.entrance}</b> -кириш
              йўлаги, <b>{shartnoma?.floor}</b>-қават, умумий майдони{" "}
              <b>{shartnoma?.field}</b> кв.м, Самарканд вилояти, Каттакургон
              тумани, Яккабог МФЙ манзилида жойлашган.
              <br />
              <br /> 1.5. Қурувчи шартномани имзолаш вақтида ушбу Шартноманинг
              1.4-бандида кўрсатилган Инвестиция объекти суд муҳокамаси предмети
              эмаслиги, банд солинмаган, тақиқдабўлмаган, гаров предмети
              бўлмаган ва учинчи шахслар ҳуқуқлари билан юкланмаганлигини
              кафолатлайди.
            </p>
          </div>
          <div className="ContractPDF__footer">
            Инвестор ______________{" "}
            <span className="ContractPDF__spacer"></span> Қурувчи ______________
          </div>
        </div>
        <div className="ContractPDF__page">
          <div>
            <div className="page_num">-  2  -</div>
            <p className="ContractPDF__desc">
              Шунингдек, юқоридаги Инвестиция объектига нисбатан натижасида
              учинчи шахсларнинг ҳуқуқлари юзага келиши мумкин бўлган илгари
              қурилишга инвестиция ҳиссаси тўғрисидаги бошқа шартнома
              тузилмаган.
            </p>
            <h2 className="ContractPDF__title">2. МАХСУС ШАРТЛАР</h2>
            <p className="ContractPDF__desc">
              2.1. “Инвестор”га мулкчиликка берилган Инвестиция объекти бўйича
              ишларнинг таркиби ва ҳажми қуйидаги асосий шартларни ҳисобга олган
              ҳолда лойиҳа-смета ҳужжатларига мувофиқ бўлиши керак:
              <br />
              <br /> 2.1.1. Инвестиция объектида ички пардозлаш ишлари: суваш,
              бўяш, хоналараро эшикларни ўрнатиш, шунингдек, иккинчи босқичнинг
              махсус монтаж ишлари: унитаз, ванна, раковиналар, смесителларни
              ўрнатиш, хонадон ички электр симларини монтаж қилиш ва
              розеткаларни, ўчириб-ёқгичлар ва ёритиш мосламалари ўрнатиш
              "Қурувчи " томонидан мустақил равишда амалга оширилади ва бу
              харажатларнинг қиймати инвестиция ҳиссаси миқдорига киритилмайди.
              <br />
              <br /> 2.1.2. "Қурувчи" Инвестиция обектига нисбатан фақат
              қуйидаги ишларни бажаради:
              <br />
              <br /> Пардозлаш ишлари:
              <br />
              <br /> 1) тўлиқ лойиҳага мувофиқ амалга оширилади – бино фасади,
              вестибюл, зина майдончалари, лифт йўлаклари;
              <br />
              <br /> 2) ташқи деворларга пластик ромлар (деразалар ва витражлар)
              ўрнатилади;
              <br />
              <br /> 3) кириш темир эшиги ўрнатилади.
              <br />
              <br /> 4) хонадондан ташқарида умумий фойдаланиш майдонларининг
              (кириш йўлаклари) барча эшиклари ўрнатилади.
              <br />
              <br /> 5) лойиҳа бўйича хонадон ичидаги барча хоналараро
              пардеворлар ўрнатилади.
              <br />
              <br /> 6) Хонадон ичидаги барча бошқа пардозлаш ишлари “ Қурувчи ”
              ҳисобидан амалга оширилади.
              <br />
              <br /> Электр монтаж ишлари:
              <br />
              <br /> 1) барча майдон ичи тармоқлар, қаватма-қават ўтказгичлар,
              қаватларга шитларни ўрнатиш, умумий фойдаланиш жойларида ёритиш ва
              бошқа қурилмаларни ўрнатиш билан электрмонтаж ишлари, ҳовли электр
              таъминоти, шунингдек, хонадон электр қутисидан майдончадаги шитга
              электр симини улаш тўлиқ амалга оширилади. Хонадоннинг ички электр
              таъминоти, розеткалар, ўчириб-ёқгичларни ўрнатиш "Қурувчи"
              маблағлари ҳисобидан амалга оширилади;
              <br />
              <br /> 2) электр ҳисоблагични ўрнатиш ишлари бажарилади.
              <br />
              <br /> Сантехника ишлари:
            </p>
          </div>
          <div className="ContractPDF__footer">
            Инвестор ______________{" "}
            <span className="ContractPDF__spacer"></span> Қурувчи ______________
          </div>
        </div>
        <div className="ContractPDF__page">
          <div>
            <div className="page_num">-  3  -</div>
            <p className="ContractPDF__desc">
              1) иситиш, совуқ сув, иссиқ сув ва канализация тизимининг барча
              ички майдон тармоқлари амалга оширилади, кириш узели ўрнатилади,
              қаватма-қават симлари ўрнатилади, қувурлар ошхоналарга,
              ҳаммомларга, ҳожатхоналарга чиқарилади ва бир-бирининг устини пана
              қилувчи кранлар (назорат кранлари, ажратгичлар) жойлаштирилади,
              совуқ сув ҳисоблагичлари ўрнатилади.
              <br />
              <br />
              Газлаштириш:
              <br />
              <br />
              1) ҳисоблагич ўрнатилиши билан ошхонада маиший газни қувур билан
              таъминлаш амалга оширилади;
              <br />
              <br />
              1) Кабел телевидениеси учун ҳам худди шундай шартлар мавжуд.
              <br />
              <br />
              Иситиш тизими:
              <br />
              <br />
              1) даҳлиз, ошхонада ва ҳаммомларда биз иссиқ пол тизимини
              яратамиз.
              <br />
              <br />
              Шамоллатиш тизими:
              <br />
              <br />
              1) ошхона, ҳаммом ва ҳожатхонадан дудбўрон тизими амалга
              оширилади. Умумий фойдаланиш жойларида дудбўрон ва оқимли
              шамоллатиш бажарилади.
              <br />
              <br />
              2.2. Томонлар объектни қуриш бўйича дастлабки рухсат берувчи,
              ҳуқуқни белгиловчи, лойиҳа-смета ҳужжатларини "Қурувчи" томонидан
              тақдим этилганлигини, "Инвестор" эса улар билан танишиб чиққанини
              тасдиқлайди, бу эса "Қурувчи" нинг Турар-жой биносини қуриш
              ҳуқуқларини тўлиқ тасдиқлаш, Инвестиция объектини аниқлаш, унинг
              ўлчамлари ва фазовий мос ёзувлар нуқталарини, Инвестиция
              объектининг ўзи ва умуман турар-жой биносининг асосий
              режалаштириш, дизайн, функционал, архитектура, бадиий, технологик,
              санитария-гигиена ва муҳандислик хусусиятларини аниқлашга имконини
              беради.
              <br />
              <br />
              2.3. “Инвестор” қурилиш ҳудудининг ижтимоий, иқтисодий, экологик
              ҳолати ҳақида етарли маълумотларга эга эканлигини тасдиқлайди.
              <br />
              <br />
              2.4. “Инвестор” юқоридаги маълумотлар миқдори ўзи учун етарли
              эканлигини ва ушбу шартномани тузиш тўғрисида қарор қабул қилиш ва
              унинг инвестициялашдаги иштироки хавфини баҳолаш учун асос
              бўлганлигини тасдиқлайди ҳамда у унга инвестициялар бўйича ўз
              мажбуриятларини тўғри бажариш имконини бериши учун ўзининг жорий
              ва келажакдаги молиявий ҳолатини етарлича баҳолаган.
              <br />
              <br />
              2.5. “Инвестор” турар-жой мулкдорининг ҳуқуқни тасдиқловчи
              ҳужжатларини (ЎзР қонунчилигига мувофиқ тегишли кадастр ва бошқа
              ҳужжатларни) олгунига қадар у Инвестиция объектини қайта
              режалаштириш ва таъмирлаш ишларини амалга оширишга ҳақли эмас.
              <br />
              <br />
              2.6. “Инвестор” инвестиция объектига эгалик ҳуқуқи ўзига ўтган
              кундан бошлаб 6 (олти) ой ичида Ўзбекистон Республикасининг
              норматив-ҳуқуқий ҳужжатлари талабларига ҳамда техник, санитария ва
              архитектура хавфсизлиги талабларига жавоб берадиган,
            </p>
          </div>
          <div className="ContractPDF__footer">
            Инвестор ______________{" "}
            <span className="ContractPDF__spacer"></span> Қурувчи ______________
          </div>
        </div>
        <div className="ContractPDF__page">
          <div>
            <div className="page_num">-  4  -</div>
            <p className="ContractPDF__desc">
              бинога ўз маблағлари ҳисобига зарар етказмасдан иккинчи босқичдаги
              барча пардозлаш ва махсус монтаж ишларини бажариш, ва белгиланган
              тартибда ва муддатларда тегишли хизматлар билан объектни сақлаш
              бўйича коммунал (эксплуатация) ва бошқа хизматлар кўрсатиш бўйича
              шартномалар тузиш мажбуриятини олади.
            </p>
            <h2 className="ContractPDF__title">
              3. ТОМОНЛАРНИНГ ҲУҚУҚ ВА МАЖБУРИЯТЛАРИ
            </h2>
            <p className="ContractPDF__desc">
              3.1. “Инвестор”нинг ҳуқуқ ва мажбуриятлари:
              <br />
              <br />
              3.1.1. "Инвестор" қурилишга ўз инвестиция ҳиссасини тўлиқ ҳажмда
              ва ушбу шартномада белгиланган муддатларда киритиши шарт.
              <br />
              <br />
              3.1.2. "Инвестор" қурилишга пул маблағларини нақд пул шаклида
              киритишга мажбурдир.
              <br />
              <br />
              3.1.3. "Инвестор" Инвестиция объектини қабул қилиш-топшириш
              далолатномаси бўйича "Қурувчидан" турар-жой биноси қурилиши
              тугаганлиги ва Объектнинг ушбу шартномага мувофиқ ўтказишга
              тайёрлиги тўғрисида билдиришнома олинган пайтдан эътиборан 10 (ўн)
              календар кун ичида қабул қилишга мажбурдир. “Инвестор” томонидан
              ҳужжатлар билан тасдиқланган қабул қилиш муддати узрсиз сабабларга
              кўра бузилган тақдирда, “Қурувчи”нинг Объектни “Инвестор”га
              ўтказиш мажбурияти бажарилган ҳисобланади ва белгиланган муддатдан
              кейин тасодифий ўлим ва/ёки объектга зарар етказиш хавфи
              "Инвестор"га ўтади.
              <br />
              <br />
              3.1.4. “Инвестор” ўз номидан, шу жумладан кўчмас мулкка бўлган
              ҳуқуқларни давлат рўйхатидан ўтказиш бўйича ваколатли органларда
              нотариал рўйхатдан ўтказиш билан боғлиқ барча харажатларни ўз
              зиммасига олишга ва тўлашга мажбурдир.
              <br />
              <br />
              3.1.5. "Инвестор" техник (реконструкция қилмаслик, юк кўтарувчи
              деворларни бузмаслик), объектнинг, турар - жой биносининг ва унга
              туташ ҳудуднинг ёнғин ва санитария қоидалари ва фойдаланиш
              нормаларига риоя қилиши, турар-жой биносининг фасадини, майдони ва
              фойдаланиш мулкини ўзгартирмаслиги, кондиционерларни, ҳар хил
              турдаги антенналар, дудбўронлар, панжараларни ўрнатишда "Қурувчи"
              билан келишиши шарт. Инвестиция объектни сақлаш харажатларини
              қоплаш учун зарур бўлган харажатларни ўз вақтида тўлаши керак.
              <br />
              <br />
              3.1.6. “Инвестор” ўз реквизитлари (паспорт маълумотлари, манзили,
              жорий ҳисоб рақами, телефон рақамлари ва бошқалар) ўзгарганлиги
              тўғрисида “Қурувчи”ни ёзма равишда хабардор қилиши ва ўзгаришлар
              содир бўлган кундан бошлаб 7 кун ичида янги маълумотларни тақдим
              этиши шарт.
              <br />
              <br />
              3.1.7. “Инвестор” “Қурувчи”дан ушбу Шартномани амалга оширишнинг
              бориши тўғрисида маълумот олишга ҳақли.
              <br />
              <br />
              3.1.8. “Инвестор” шартномани бир томонлама бекор қилиш ва ўзи
              томонидан инвестиция депозити ҳисобварағига қўйилган маблағларни
              ушбу Шартномада назарда тутилган жарима ва пенялар чегириб
              ташланган ҳолда олишга ҳақли.
              <br />
              <br />
              3.2. “Қурувчи”нинг ҳуқуқ ва мажбуриятлари:
            </p>
          </div>
          <div className="ContractPDF__footer">
            Инвестор ______________{" "}
            <span className="ContractPDF__spacer"></span> Қурувчи ______________
          </div>
        </div>
        <div className="ContractPDF__page">
          <div>
            <div className="page_num">-  5  -</div>
            <p className="ContractPDF__desc">
              3.2.1. “Қурувчи” “Инвестор”нинг инвестиция ҳиссасидан ушбу
              Шартноманинг предметига мувофиқ мақсадли фойдаланишни таъминлаши
              шарт.
              <br />
              <br />
              3.2.2. “Қурувчи” турар жой биносини қуриш ва фойдаланишга
              топширишни лойиҳа-смета ҳужжатларига, шаҳарсозлик нормалари ва
              қоидаларига мувофиқ амалга ошириши шарт.
              <br />
              <br />
              3.2.3. "Қурувчи" белгиланган тартибда "Қурилиши тугалланган
              объектни қабул қилиш тўғрисидаги Давлат қабул комиссиясининг
              далолатномаси" тасдиқланган пайтдан эътиборан 30 кун ичида ушбу
              шартнома шартларига мувофиқ инвестиция ҳиссаси тўлиқ миқдорда
              киритилгандан сўнг объектни қабул қилиш-топширишга тайёрлиги
              тўғрисида "Инвесторга " хабарнома юбориши шарт.
              <br />
              <br />
              3.2.4. Объект фойдаланишга топширилгандан ва унга кадастр
              ҳужжатлари расмийлаштирилгандан кейин бир ой ичида "Қурувчи"
              "Инвестор"га ушбу шартноманинг 1.4-бандига мос келадиган объектни,
              агар “Инвестор” инвестиция ҳиссасини қўшиш бўйича ўз
              мажбуриятларини тўлиқ ва лозим даражада бажарган тақдирда; қабул
              қилиш ва топшириш далолатномаси бўйича топшириши, шунингдек
              "Инвестор"га унинг номига эгалик ҳуқуқини рўйхатдан ўтказиш учун
              барча зарур ҳужжатларни тақдим этиши шарт. Объект бўйича кадастр
              ҳужжатларини расмийлаштириш вақтида инвестиция ҳиссаси тўлиқ
              тўланмаган тақдирда, инвестиция объектини ўтказиш "Инвестор"
              томонидан инвестиция ҳиссаси тўлиқ тўланган кундан бошлаб 20
              (йигирма) кун ичида амалга оширилади.
              <br />
              <br />
              3.2.5. Агар бу объектив равишда шаҳарсозлик нормалари ва
              қоидаларининг қўшимча талабларини бажариш билан боғлиқ бўлса,
              "Қурувчи" турар-жой биносини қуришни якунлаш муддатларини бир
              томонлама ўзгартиришга ҳақли.
              <br />
              <br />
              3.2.6. "Қурувчи" "Инвестор" томонидан инвестиция ҳиссасини киритиш
              муддатлари бир томонлама тартибда бузилган тақдирда ушбу
              шартномани бекор қилиш ва "Инвестор" томонидан инвестиция ҳиссаси
              ҳисобига киритилган пул маблағларини ушбу шартномада назарда
              тутилган жарималар ва пенялар миқдорини олиб ташлаган ҳолда
              қайтариш ҳуқуқига эга. Бунда “Инвестор”га маблағларни қайтариш
              инвестиция депозити қайси шаклда амалга оширилганлигидан қатъий
              назар, “Инвестор” томонидан кўрсатилган банк ҳисобварағига нақд
              пулсиз шаклда амалга оширилади.
            </p>
            <h2 className="ContractPDF__title">
              4. ИНВЕСТИЦИЯ МИҚДОРИ ВА ҲИСОБ-КИТОБ ТАРТИБИ
            </h2>
            <p className="ContractPDF__desc">
              4.1. “Инвестор” томонидан инвестиция ҳиссаси сифатида
              киритиладиган инвестициялар суммаси{" "}
              <b>{formatmoney(shartnoma?.umumiy_summa)}</b>      (
              <b>{numberToUzbekWords(shartnoma?.umumiy_summa)}</b> ) сўмни
              ташкил этади. <br />
              <br /> 4.2. Инвестицион бадал миқдорини ҳисоблаш учун шартноманинг
              1.4-бандига мувофиқ яшаш хонадонининг умумий майдони ва яшаш
              хонадонининг (Инвестиция объекти) 1 м2 қиймати турар-жой биносини
              қуришда иштирок этиш учун инвестиция ҳиссасининг шартнома нархини
              келишиш протоколига мувофиқ белгиланади (ушбу Шартномага 1-илова)
              ва “Инвестор” ушбу Шартноманинг 2-иловасига (кейинги ўринларда
              Жадвал деб юритилади) биноан инвестиция ҳиссасини киритиш
              жадвалига мувофиқ ушбу
            </p>
          </div>
          <div className="ContractPDF__footer">
            Инвестор ______________{" "}
            <span className="ContractPDF__spacer"></span> Қурувчи ______________
          </div>
        </div>
        <div className="ContractPDF__page">
          <div>
            <div className="page_num">-  6  -</div>
            <p className="ContractPDF__desc">
              Шартноманинг 4.1-бандида назарда тутилган инвестиция ҳиссаси
              суммасининг 100 фоизини тўлаш мажбуриятини олади.
              <br />
              <br />
              4.3. “Инвестор” Жадвалда назарда тутилган муддатлар тугашини
              кутмасдан, ўз инвестиция ҳиссасини муддатидан олдин киритишга
              ҳақли. “Инвестор” “Қурувчи”нинг ҳисоб-китоб ҳисобварағига
              Ўзбекистон Республикасининг миллий валютасида сўмда инвестиция
              бадалини киритади. Инвестиция суммаларини ўтказиш (киритиш)
              тўғрисидаги тўлов ҳужжатида “Инвестор” тўлов деталларида
              қуйидагиларни кўрсатади: “
              <b>{getDayFromDate(shartnoma?.created_at)}</b>”{" "}
              <b>{getMonthName(shartnoma?.created_at)} </b>
              <b>{getYearFromDate(shartnoma?.created_at)}</b> йилдаги{" "}
              <b>{shartnoma?.id}</b> - сонли Шартномага мувофиқ Турар-жой биноси
              қурилишига инвестиция киритиш бўйича тўлов".
              <br />
              <br />
              4.4. “Инвестор” томонидан нақд пул кўринишида инвестиция ҳиссаси
              киритганлигини тасдиқловчи ҳужжат тўловни қабул қилганлиги
              тўғрисидаги банк белгиси бўлган банк тўлов (касса) ордери
              (квитанцияси) ҳисобланади.
              <br />
              <br />
              4.5. “Инвестор”нинг инвестиция киритиш мажбурияти бажарилган сана
              “Қурувчи”га хизмат кўрсатувчи банкнинг баёнотига кўра
              “Қурувчи”нинг ҳисоб-китоб ҳисобварағига маблағлар киритилган кун
              ҳисобланади.
              <br />
              <br />
              4.6. “Инвестор” “Қурувчи”га ушбу шартномада белгиланган
              мақсадларда – Турар-жой биносини, шу жумладан Инвестиция объектини
              қуриш-монтаж ишларини бажариш учун инвестиция депозитига эгалик
              қилиш, ундан фойдаланиш, уни тасарруф этиш бўйича чексиз ҳуқуқлар
              беради.
              <br />
              <br />
              4.7. Шартноманинг 4.1-бандида кўрсатилган инвестиция миқдори
              якуний ҳисобланади ва ўзгартирилиши мумкин эмас, ушбу Шартноманинг
              5.3 ва 5.4-бандларида назарда тутилган ҳоллар бундан мустасно.
            </p>
            <h2 className="ContractPDF__title">
              5. МАХСУС ШАРТЛАР ВА СИФАТ КАФОЛАТЛАРИ
            </h2>
            <p className="ContractPDF__desc">
              5.1. “Инвестор”нинг инвестиция объектига бўлган мулк ҳуқуқи
              Ўзбекистон Республикаси қонун ҳужжатларида белгиланган тартибда
              мулк ҳуқуқи давлат рўйхатидан ўтказилгандан кейин вужудга келади.
              <br />
              <br />
              5.2. Ҳуқуқлари инвестор томонидан сотиб олинган яшаш хонадонининг
              умумий майдони бинони инвентаризация қилиш натижаларига кўра ва
              кадастр ҳужжатларига мувофиқ қурилиш тугагандан сўнг аниқланиши
              керак.
              <br />
              <br />
              5.3. Агар инвестиция объекти-хонадоннинг умумий майдони кадастр
              ҳужжатларига мувофиқ ушбу Шартноманинг 1.4-бандида кўрсатилган
              майдондан кўп бўлса, "Инвестор" кадастр ҳужжатлари олинган кундан
              бошлаб 10 (ўн) банк куни ичида объект майдонининг катталашишига
              мос келадиган ва шартнома нархи (4.2-банд) асосида ҳисобланган
              қўшимча инвестиция бадалини киритиши шарт.
              <br />
              <br />
              5.4. Агар инвестиция объекти-хонадоннинг умумий майдони кадастр
              ҳужжатларига мувофиқ ушбу Шартноманинг 1.4-бандида кўрсатилган
              майдондан кам бўлса, "Қурувчи" инвестиция ҳиссаси сифатида ортиқча
              қўшилган, объект майдонига мос келадиган ва шартнома нархидан
              (4.2-банд.) келиб чиққан ҳолда ҳисобланган маблағларни{" "}
            </p>
          </div>
          <div className="ContractPDF__footer">
            Инвестор ______________{" "}
            <span className="ContractPDF__spacer"></span> Қурувчи ______________
          </div>
        </div>
        <div className="ContractPDF__page">
          <div>
            <div className="page_num">-  7  -</div>
            <p className="ContractPDF__desc">
              "Инвестор"га кадастр ҳужжатлари олинган кундан бошлаб 10 (ўн) банк
              куни ичида қайтариши ёки шартноманинг умумий қийматини тегишли
              миқдорга камайтириши шарт.
              <br />
              <br />
              5.5. Томонлар инвестиция объекти сифатининг кафолати, унинг
              лойиҳаси, шаҳарсозлик нормалари ва қоидаларига мувофиқлиги давлат
              қабул комиссиясининг қурилиши тугалланган турар-жой биносини
              белгиланган тартибда тасдиқланган фойдаланишга қабул қилиш
              тўғрисидаги далолатномаси эканлигидан келиб чиқади.
              <br />
              <br />
              5.6. “Инвестор” инвестиция объекти мулк ҳуқуқи рўйхатга олинган ва
              қабул қилиш-топшириш далолатномаси имзоланган кундан бошлаб 1
              (бир) ой ичида яширин нуқсонлар аниқланганлиги муносабати билан
              “Қурувчи”га даъво аризаси беришга ҳақли. Барча даъволар асосли
              бўлиши ва ёзма равишда "Қурувчи" га тақдим этилиши керак.
              <br />
              <br />
              5.7. “Қурувчи” даъво келиб тушган кундан эътиборан 15 кун ичида
              “Инвестор”нинг даъвосини кўриб чиқиши ва агар у асосли бўлса,
              аниқланган камчиликларни ўз маблағлари ҳисобидан ва ўз кучи билан
              бартараф этиши шарт.
              <br />
              <br />
              5.8. Ушбу шартноманинг 1.5-бандида назарда тутилган объектни
              топшириш муддати томонларнинг келишуви билан узайтирилиши мумкин.
              Объектни топшириш муддати, агар ҳолат ушбу шартномани тузиш
              пайтида томонлар олдиндан кўра олмайдиган доимий равишда ўзгарган
              ҳолатлар билан боғлиқ бўлса, ушбу шартноманинг 3.2.5-бандига
              биноан мажбурий равишда узайтирилиши керак.
            </p>
            <h2 className="ContractPDF__title">
              6. ТОМОНЛАРНИНГ ЖАВОБГАРЛИГИ ВА НИЗОЛАРНИ ҲАЛ ҚИЛИШ ТАРТИБИ
            </h2>
            <p className="ContractPDF__desc">
              6.1. Ушбу Шартномада (Жадвалда) назарда тутилган инвестиция
              ҳиссасини киритиш муддатларини бузганлик учун "Инвестор"
              "Қурувчига" кечиктирилган ҳар бир кун учун ўз вақтида тўланмаган
              сумманинг 0,1% миқдорида, лекин ушбу шартноманинг 4.1-бандида
              назарда тутилган инвестиция ҳиссасининг умумий миқдорининг 10% дан
              кўп бўлмаган миқдорда жарима тўлайди.
              <br />
              <br />
              6.2. Жадвалда 1 (бир) ойдан кўпроқ вақт давомида назарда тутилган
              муддатларни бузганлик учун "Қурувчи" шартномани бекор қилишнинг
              кутилган вақтидан 10 календар кун олдин "Инвестор"га ёзма равишда
              хабар бериш орқали ушбу шартномани бир томонлама суддан ташқари
              бекор қилиш ҳуқуқига эга. Бундай ҳолда, "Қурувчи" бошқа инвесторни
              объектни инвестициялашга жалб қилиш ва "Инвестор" томонидан
              инвестиция ҳиссаси сифатида факт бўйича киритилган пул
              маблағларини ушбу шартномада назарда тутилган жарималар ва пенялар
              миқдорини олиб ташлаган ҳолда, ушбу шартнома бекор қилинганлиги
              тўғрисида "Инвестор" га хабарнома юборилган кундан бошлаб 60
              (олтмиш) банк куни ичида қайтариб бериш ҳуқуқига эга.
              <br />
              <br />
              6.3. Инвестиция объекти мулкини "Инвестор"га топшириш муддатларини
              асоссиз равишда бузганлик учун "Қурувчи" "Инвестор"га
              кечиктирилган ҳар бир кун учун инвестиция бадалининг умумий
              суммасидан 0,1% миқдорида, лекин мазкур
            </p>
          </div>
          <div className="ContractPDF__footer">
            Инвестор ______________{" "}
            <span className="ContractPDF__spacer"></span> Қурувчи ______________
          </div>
        </div>
        <div className="ContractPDF__page">
          <div>
            <div className="page_num">-  8  -</div>
            <p className="ContractPDF__desc">
              Шартноманинг 4.1-бандда назарда тутилган инвестиция ҳиссасининг
              умумий суммасининг 10% дан кўп бўлмаган миқдорда жарима тўлайди.
              <br />
              <br />
              6.4. Агар "Инвестор" ушбу шартномани бажаришдан бир томонлама бош
              тортса ва "Инвестор" ташаббуси билан уни бекор қилса,
              "Қурувчи"нинг айби бўлмаса ёки "Қурувчи" томонидан "Инвестор" ушбу
              шартнома бўйича ўз мажбуриятларини бузганлиги учун бекор қилинса,
              "Инвестор" "Қурувчи" га ушбу Шартноманинг 4.1-бандида назарда
              тутилган инвестиция ҳиссасининг умумий миқдоридан 15% (ўн беш
              фоиз) миқдорида жарима тўлайди. Бундай ҳолда, "Қурувчи" ушбу
              шартнома бекор қилинган кундан бошлаб 60 (олтмиш) банк куни ичида
              ушбу бандда кўрсатилган жарима миқдорини олиб ташлаган ҳолда
              "Инвестор"га инвестиция ҳиссасининг тўланган миқдорини қайтаради.
              <br />
              <br />
              6.5. 6.4-бандда назарда тутилган ҳолатлар туфайли инвестиция
              ҳиссаси сифатида ўзи киритган маблағлар "Инвестор"га қайтарилган
              тақдирда, ушбу Шартнома бўйича “Инвестор” Ўзбекистон Республикаси
              Фуқаролик кодексининг 327-моддасига мувофиқ “Қурувчи”дан бошқа
              шахсларнинг маблағларидан фойдаланганлик учун фоизларни талаб
              қилишга ҳақли эмас.
              <br />
              <br />
              6.6. Қолган ҳолатларда, томонларнинг шартнома бўйича ўз
              мажбуриятларини бажармаганликлари ёки лозим даражада
              бажармаганликлари учун жавобгарлиги Ўзбекистон Республикасининг
              Фуқаролик кодекси ва Ўзбекистон Республикаси қонун ҳужжатларининг
              бошқа меъёрий ҳужжатлари билан белгиланади.
              <br />
              <br />
              6.7. Ушбу шартнома бўйича барча низолар ва келишмовчиликлар
              низоларни ҳал қилишнинг даъво тартибига риоя қилган ҳолда
              музокаралар йўли билан ҳал қилинади. Даъвони олган томон уни
              белгиланган тартибда кўриб чиқиши ва олинган кундан бошлаб 10
              календар кундан кечиктирмай унга ёзма асосли жавоб бериши шарт.
              Агар томонлар ушбу шартнома бўйича келишувга эришмаган бўлсалар,
              низо "Қурувчи" жойлашган жойда фуқаролик судида, шартнома
              юрисдикцияси тартибида кўриб чиқилиши керак. Низони кўриб чиқиш
              тили рус тилидир. Қўлланилувчи қонун - Ўзбекистон Республикаси
              қонунчилиги.
            </p>
            <h2 className="ContractPDF__title">7. ФОРС-МАЖОР</h2>
            <p className="ContractPDF__desc">
              7.1. Форс-мажор ҳолатлари, яъни берилган шароитларда фавқулодда ва
              олдиндан аниқлаб бўлмайдиган ҳолатлар: сув тошқинлари, ёнғинлар,
              зилзилалар, объектни қуриш тақиқланган об-ҳаво шароитлари,
              эпидемиялар, ҳарбий можаролар, террористик ҳаракатлар, фуқаролар
              тартибсизликлари, иш ташлашлар, Томонларнинг ушбу Шартнома бўйича
              мажбуриятларини бажаришига таъсир қилувчи давлат органлари
              томонидан чиқарилган кўрсатмалар, буйруқлар ёки бошқа чекловлар
              юзага келган тақдирда, ушбу ҳолатларнинг бажарилиш муддатлари,
              агар улар ушбу Шартноманинг шартларига ёки форс-мажор ҳолатлари
              бошланганидан кейин бажарилиши керак бўлган қисмига сезиларли
              таъсир кўрсатса, ушбу ҳолатларнинг таъсир қилиш муддатига
              мутаносиб равишда кечиктирилади.
              <br />
              <br />
              7.2. 7.1-бандда кўрсатилган ҳолатлар юзага келган тақдирда,
              тегишли томон бошқа томонни 30 календар куни ичида бундай ҳолатлар
              юзага келганлиги тўғрисида ёзма
            </p>
          </div>
          <div className="ContractPDF__footer">
            Инвестор ______________{" "}
            <span className="ContractPDF__spacer"></span> Қурувчи ______________
          </div>
        </div>
        <div className="ContractPDF__page">
          <div>
            <div className="page_num">-  9  -</div>
            <p className="ContractPDF__desc">
              равишда хабардор қилиши шарт. Форс-мажор ҳолатлари юзага
              келганлиги тўғрисида хабардор қилинмаган тақдирда, тараф бундай
              ҳолатларни форс-мажор деб аташ ҳуқуқини йўқотади.
              <br />
              <br />
              7.3. Агар форс-мажор ҳолатлари кетма-кет ёки жами 3 ойдан ортиқ
              давом этса, ушбу шартнома ҳар қандай томоннинг ташаббуси билан 60
              (олтмиш) банк куни ичида "Инвесторга" инвестиция ҳиссаси суммасини
              қайтариб бериш билан бекор қилиниши керак.
            </p>
            <h2 className="ContractPDF__title">
              8. ШАРТНОМАНИ ЎЗГАРТИРИШ ВА БЕКОР ҚИЛИШ{" "}
            </h2>
            <p className="ContractPDF__desc">
              8.1. Агар Ўзбекистон Республикаси қонун ҳужжатларига ўзгартиришлар
              киритилган бўлса, бунинг натижасида ушбу Шартноманинг ҳар қандай
              қоидалари Ўзбекистон Республикаси қонунчилигига мос келмай қолса,
              бу ушбу шартноманинг бошқа қоидалари бажарилишига таъсир қилмайди.
              Шартноманинг қонунга мувофиқлиги тўхтаган қоидалари, томонларнинг
              ўзаро ёзма розилиги билан, имкон қадар қисқа вақт ичида
              алмаштириладиган қоидага маъно ва мақсад жиҳатидан энг яқин бўлган
              қоида билан алмаштирилади.
              <br />
              <br />
              8.2. Томонлар тарафидан ушбу шартномани муддатидан олдин бекор
              қилиш қуйидаги ҳолларда мумкин:
              <br />
              <br />
              8.2.1. Томонларнинг ўзаро келишуви бўйича;
              <br />
              <br />
              8.2.2. “Қурувчи” ташаббуси билан;
              <br />
              <br />
              8.2.3. “Инвестор” ташаббуси билан;
              <br />
              <br />
              8.2.4. Форс-мажор ҳолатлари туфайли.
              <br />
              <br />
              8.3. Ушбу Шартномани муддатидан олдин бекор қилиш ёзма равишда
              бекор қилиш тўғрисидаги битимни имзолаш орқали амалга оширилиши
              керак, томонлардан бири тарафидан суддан ташқари бир томонлама
              бекор қилинган ҳолатлар бундан мустасно.
              <br />
              <br />
              8.4. Томонлардан бири ушбу Шартномани бажаришдан бир томонлама бош
              тортган тақдирда, шартнома бошқа томонга шартномани бажаришни бир
              томонлама рад этиш тўғрисида билдиришнома юборилган кундан бошлаб
              бекор қилинган ҳисобланади. Белгиланган хабарнома илова тавсифи
              билан рўйхатдан ўтган почта орқали юборилиши керак.
              <br />
              <br />
              8.5. Ушбу шартномага киритилган ҳар қандай ўзгартириш ва
              қўшимчалар, шу жумладан мажбуриятдаги шахсларнинг ўзгариши (даъво
              ҳуқуқини бериш, қарзни ўтказиш ва бошқалар) иккала томон тарафидан
              келишиб олинади, ушбу шартномага қўшимча ёки алоҳида битим имзолаш
              орқали ёзма равишда расмийлаштирилади.
              <br />
              <br />
              8.6. Томонлар ушбу шартнома бўйича ўз ҳуқуқ ва мажбуриятларини
              бошқа томоннинг ёзма розилигисиз учинчи шахсларга топширишга ҳақли
              эмас.
              <br />
              <br />
              8.7. Ушбу Шартномада назарда тутилмаган ҳолларда томонлар
              Ўзбекистон Республикасининг амалдаги қонунчилигига амал қиладилар.
            </p>
          </div>
          <div className="ContractPDF__footer">
            Инвестор ______________{" "}
            <span className="ContractPDF__spacer"></span> Қурувчи ______________
          </div>
        </div>
        <div className="ContractPDF__page">
          <div>
            <div className="page_num">-  10  -</div>
            <p className="ContractPDF__desc">
              8.8. Ушбу Шартномага иловалар унинг ажралмас қисмини ташкил этади.
              <br />
              <br />
              8.9. Тафсилотларни ўзгартиришда томонлар 7 (етти) кун ичида содир
              бўлган ўзгаришлар тўғрисида бир-бирларини ёзма равишда хабардор
              қилишлари ва янги маълумотларни тақдим этишлари шарт.
            </p>
            <h2 className="ContractPDF__title">9. ЯКУНИЙ ҚОИДАЛАР</h2>
            <p className="ContractPDF__desc">
              9.1. Ушбу шартнома имзоланган пайтдан бошлаб кучга киради ва
              томонлар ўз мажбуриятларини тўлиқ бажаргунга қадар ва ўзаро
              ҳисоб-китоблар тугагунига қадар амал қилади.
              <br />
              <br />
              9.2. Ушбу шартнома бир хил юридик кучга эга бўлган иккита ҳақиқий
              нусхада тузилади ва ҳар бир томон учун биттадан берилади.
              <br />
              <br />
              9.3. Ушбу шартномани имзолашда "Инвестор" "Қурувчига" қуйидаги
              ҳужжатларни тақдим этишга мажбурдир:
              <br />
              <br />- Амалдаги яшаш жойидан рўйхатга қўйилганлиги қайдномаси
              билан фуқаролик паспортининг нусхаси;
              <br />
              <br /> Мен, <b>{shartnoma?.fullName}</b>, ушбу Шартномани ўқиб
              чиқдим ва унинг барча бандлари билан танишдим. Турар-жой
              биносининг барча шароитлари (фасад, вестибюл, хонадон режаси,
              жойлашуви, хонадоннинг майдони ва бошқалар) мени қониқтиради.
            </p>
            <h2 className="ContractPDF__title">
              10. ТОМОНЛАРНИНГ МАНЗИЛЛАРИ, БАНК РЕКВИЗИТЛАРИ ВА ИМЗОЛАРИ
            </h2>
            <div className="checking">
              <div className="checking__left">
                <h4 className="checking__title">ҚУРУВЧИ</h4>
                <h3 className="checking__headname">
                  “ISHBEKOV STROI SERVICE” МЧЖ{" "}
                </h3>
                <p className="checking__address">
                  Манзил:{" "}
                  <b>
                    Самарканд вилояти, Каттакургон тумани, Яккабог МФЙ, Иска
                    қишлоғи, 1-уй.
                  </b>
                  <br />
                  <br />
                  <b>Ўз.Р. ТИФ Миллий Банкдаги</b>
                  <br />
                  ҳ/р: <b>20208000305559306001</b>
                  <br />
                  <br />
                  МФО: <b>00450</b> <br /> СТИР: <b>309793993</b> <br /> ОКЭД:{" "}
                  <b>41201</b> <br /> Тел: <b>+998770050038</b>
                  <br />
                  <br />
                  <br />
                  <br />
                  <b>Директор:_____________Т.И. Ишбеков </b>
                </p>
              </div>
              <div className="checking__right">
                <h4 className="checking__title">ИНВЕСТОР</h4>
                <h3 className="checking__headname">
                  <i>{shartnoma?.fullName}</i>
                </h3>
                <p className="checking__address">
                  Манзил: <b>{shartnoma?.address}</b>
                  <br />
                  <br />
                  <br /> Паспорт: № <b>{shartnoma?.seria}</b> берилган{" "}
                  <b>{shartnoma?.pass_ber_joy}</b> ТИИБ ,
                  <br />
                  <br />
                  PINFL: <b>{shartnoma?.pinfl}</b>
                  <br />
                  <br />
                  <br />
                  <br />
                  <br />
                  ______________________
                </p>
              </div>
            </div>
          </div>
          <div className="ContractPDF__footer">
            Инвестор ______________{" "}
            <span className="ContractPDF__spacer"></span> Қурувчи ______________
          </div>
        </div>
        
      </div>
    </div>
  );
};
