import React, { useContext } from "react";
import "./contract-pdf.css";
import { MainContext } from "../../../utils/context/context";
import {
  formatDate,
  formatmoney,
  numberToUzbekWords,
} from "../../../utils/functions";

export const ContractPDF = () => {
  const { shartnoma } = useContext(MainContext);

  if (!shartnoma) {
    window.location.assign("/contract-list");
  }

  console.log(shartnoma);

  return (
    <div className="ContractPDF">
      <div className="ContractPDF__list">
        <div className="ContractPDF__page">
          <div>
            <div className="page_num">-  1  -</div>
            <h1 className="ContractPDF__header">
              Кўп хонадонли турар-жой биноси қурилишига инвестиция ҳиссаси
            </h1>
            <h2 className="ContractPDF__title">ШАРТНОМАСИ № {shartnoma?.id}</h2>
            <div className="ContractPDF_head">
              <p>Каттакурғон тумани. </p>
              <p>{formatDate(shartnoma?.created_at, true)}</p>
            </div>
            <p className="ContractPDF__desc">
              ЎзР фуқароси <b>{shartnoma?.fullName}</b>, паспорт рақами{" "}
              <b>{shartnoma?.seria}</b>, <b>{shartnoma?.pass_ber_joy}</b> ТИИБ
              томонидан берилган, бундан кейин матнда “Инвестор” деб юритилади,
              бир томондан ва “ISHBEKOV STROI SERVICE” МЧЖ, бундан кейин матнда
              “Қурувчи” деб юритилади, Директори номидан Устав асосида иш
              юритувчи Т.И. Ишбеков, бошқа томондан, биргаликда “Томонлар”, якка
              ҳолда эса “Томон” деб юритилади, ўз хоҳиш-иродаси ва ўз
              манфаатларини кўзлаб ҳаракат қилиб, ушбу Шартномани қуйидагича
              туздилар:
            </p>
            <h2 className="ContractPDF__title">1. ШАРТНОМА ПРЕДМЕТИ</h2>
            <p className="ContractPDF__desc">
              1.1. "Қурувчи" ўз кучи билан ва (ёки) бошқа шахслар “STRONG
              FOUNDATIONS” МЧЖ Пудратчи ташкилотларни жалб қилган ҳолда
              қурилиш-монтаж ишларини бошлаш учун обектни рўйхатдан ўтказиш
              тўғрисидаги 04.04.2024 йилдаги 1-сон шартнома асосида Самарканд
              вилояти, Каттакургон тумани, Яккабог МФЙ, Иска қишоғи,1-уй
              манзилида жойлашган куп қаватли турар-жой (кейинги ўринларда
              "Турар-жой биноси" деб аталади) қуриш мажбуриятини олади ва
              Турар-жой биноси фойдаланишга топширилгандан сўнг ушбу шартномада
              белгиланган Инвестиция объектини "Инвесторга" топширади,
              "Инвестор" эса ушбу шартномада белгиланган тартибда ва муддатларда
              Турар-жой биносини қуришга инвестицияларни амалга ошириш ва
              Инвестиция объектини ўз мулкига қабул қилиш мажбуриятини олади.
              <br />
              <br />
              Турар-жой қуриш учун 3,5 гектар ер участкаси 06.06.2023 йилдаги
              YK-1718215/2267192-сонли кўчмас мулкка бўлган ҳуқуқларни давлат
              рўйхатидан ўтказиш тўғрисидаги Давлат реестридан кўчирма асосида
              ушбу ер участкасини ҳуқуқига эга. <br />
              <br /> 1.2. "Қурувчи" "ISHBEKOV STROI SERVICE" МЧЖ томонидан ишлаб
              чиқилган ва Ўзбекистон Республикаси Қурилиш вазирлиги ҳузуридаги
              Қурилиш соҳасида назорат инспекцияси томонидан
              5890-8665-27ed-5647-7077-5734-2801-сонли ва 97949-сонли хулосаси
              билан тасдиқланган лойиҳа-смета ҳужжатлари асосида турар-жой
              биноси қурилишини амалга оширади. <br />
              <br /> 1.3. Давлат қабул комиссияси томонидан турар-жой биносини
              тугатишнинг режалаштирилган муддати 2025- йилнинг III-чораги.
              <br />
              <br />
              1.4. Ушбу шартнома бўйича Инвестиция объекти лойиҳага мувофиқ
              қуйидаги хусусиятларга эга: <b>{shartnoma?.number_of_rooms}</b> (
              <b>{numberToUzbekWords(shartnoma?.number_of_rooms)} </b> ) хонали
              хонадон (жойлашуви: лифт билан, ўнгда/чап тарафда) Турар-жой
              биноси ( <b>Блок 1</b> ), <b>{shartnoma?.entrance}</b> -кириш
              йўлаги, <b>{shartnoma?.floor}</b>-қават, умумий майдони{" "}
              <b>{shartnoma?.field}</b> кв.м, Самарканд вилояти, Каттакургон
              тумани, Яккабог МФЙ манзилида жойлашган.
              <br />
              <br /> 1.5. Қурувчи шартномани имзолаш вақтида ушбу Шартноманинг
              1.4-бандида кўрсатилган Инвестиция объекти суд муҳокамаси предмети
              эмаслиги, банд солинмаган, тақиқдабўлмаган, гаров предмети
              бўлмаган ва учинчи шахслар ҳуқуқлари билан юкланмаганлигини
              кафолатлайди.
            </p>
          </div>
          <div className="ContractPDF__footer">
            Инвестор ______________{" "}
            <span className="ContractPDF__spacer"></span> Қурувчи ______________
          </div>
        </div>
        <div className="ContractPDF__page">
          <div>
            <div className="page_num">-  2  -</div>
            <p className="ContractPDF__desc">
              Шунингдек, юқоридаги Инвестиция объектига нисбатан натижасида
              учинчи шахсларнинг ҳуқуқлари юзага келиши мумкин бўлган илгари
              қурилишга инвестиция ҳиссаси тўғрисидаги бошқа шартнома
              тузилмаган.
            </p>
            <h2 className="ContractPDF__title">2. МАХСУС ШАРТЛАР</h2>
            <p className="ContractPDF__desc">
              2.1. “Инвестор”га мулкчиликка берилган Инвестиция объекти бўйича
              ишларнинг таркиби ва ҳажми қуйидаги асосий шартларни ҳисобга олган
              ҳолда лойиҳа-смета ҳужжатларига мувофиқ бўлиши керак:
              <br />
              <br /> 2.1.1. Инвестиция объектида ички пардозлаш ишлари: суваш,
              бўяш, хоналараро эшикларни ўрнатиш, шунингдек, иккинчи босқичнинг
              махсус монтаж ишлари: унитаз, ванна, раковиналар, смесителларни
              ўрнатиш, хонадон ички электр симларини монтаж қилиш ва
              розеткаларни, ўчириб-ёқгичлар ва ёритиш мосламалари ўрнатиш
              "Қурувчи " томонидан мустақил равишда амалга оширилади ва бу
              харажатларнинг қиймати инвестиция ҳиссаси миқдорига киритилмайди.
              <br />
              <br /> 2.1.2. "Қурувчи" Инвестиция обектига нисбатан фақат
              қуйидаги ишларни бажаради:
              <br />
              <br /> Пардозлаш ишлари:
              <br />
              <br /> 1) тўлиқ лойиҳага мувофиқ амалга оширилади – бино фасади,
              вестибюл, зина майдончалари, лифт йўлаклари;
              <br />
              <br /> 2) ташқи деворларга пластик ромлар (деразалар ва витражлар)
              ўрнатилади;
              <br />
              <br /> 3) кириш темир эшиги ўрнатилади.
              <br />
              <br /> 4) хонадондан ташқарида умумий фойдаланиш майдонларининг
              (кириш йўлаклари) барча эшиклари ўрнатилади.
              <br />
              <br /> 5) лойиҳа бўйича хонадон ичидаги барча хоналараро
              пардеворлар ўрнатилади.
              <br />
              <br /> 6) Хонадон ичидаги барча бошқа пардозлаш ишлари “ Қурувчи ”
              ҳисобидан амалга оширилади.
              <br />
              <br /> Электр монтаж ишлари:
              <br />
              <br /> 1) барча майдон ичи тармоқлар, қаватма-қават ўтказгичлар,
              қаватларга шитларни ўрнатиш, умумий фойдаланиш жойларида ёритиш ва
              бошқа қурилмаларни ўрнатиш билан электрмонтаж ишлари, ҳовли электр
              таъминоти, шунингдек, хонадон электр қутисидан майдончадаги шитга
              электр симини улаш тўлиқ амалга оширилади. Хонадоннинг ички электр
              таъминоти, розеткалар, ўчириб-ёқгичларни ўрнатиш "Қурувчи"
              маблағлари ҳисобидан амалга оширилади;
              <br />
              <br /> 2) электр ҳисоблагични ўрнатиш ишлари бажарилади.
              <br />
              <br /> Сантехника ишлари:
            </p>
          </div>
          <div className="ContractPDF__footer">
            Инвестор ______________{" "}
            <span className="ContractPDF__spacer"></span> Қурувчи ______________
          </div>
        </div>
        <div className="ContractPDF__page">
          <div>
            <div className="page_num">-  3  -</div>
            <p className="ContractPDF__desc">
              1) иситиш, совуқ сув, иссиқ сув ва канализация тизимининг барча
              ички майдон тармоқлари амалга оширилади, кириш узели ўрнатилади,
              қаватма-қават симлари ўрнатилади, қувурлар ошхоналарга,
              ҳаммомларга, ҳожатхоналарга чиқарилади ва бир-бирининг устини пана
              қилувчи кранлар (назорат кранлари, ажратгичлар) жойлаштирилади,
              совуқ сув ҳисоблагичлари ўрнатилади.
              <br />
              <br />
              Газлаштириш:
              <br />
              <br />
              1) ҳисоблагич ўрнатилиши билан ошхонада маиший газни қувур билан
              таъминлаш амалга оширилади;
              <br />
              <br />
              1) Кабел телевидениеси учун ҳам худди шундай шартлар мавжуд.
              <br />
              <br />
              Иситиш тизими:
              <br />
              <br />
              1) даҳлиз, ошхонада ва ҳаммомларда биз иссиқ пол тизимини
              яратамиз.
              <br />
              <br />
              Шамоллатиш тизими:
              <br />
              <br />
              1) ошхона, ҳаммом ва ҳожатхонадан дудбўрон тизими амалга
              оширилади. Умумий фойдаланиш жойларида дудбўрон ва оқимли
              шамоллатиш бажарилади.
              <br />
              <br />
              2.2. Томонлар объектни қуриш бўйича дастлабки рухсат берувчи,
              ҳуқуқни белгиловчи, лойиҳа-смета ҳужжатларини "Қурувчи" томонидан
              тақдим этилганлигини, "Инвестор" эса улар билан танишиб чиққанини
              тасдиқлайди, бу эса "Қурувчи" нинг Турар-жой биносини қуриш
              ҳуқуқларини тўлиқ тасдиқлаш, Инвестиция объектини аниқлаш, унинг
              ўлчамлари ва фазовий мос ёзувлар нуқталарини, Инвестиция
              объектининг ўзи ва умуман турар-жой биносининг асосий
              режалаштириш, дизайн, функционал, архитектура, бадиий, технологик,
              санитария-гигиена ва муҳандислик хусусиятларини аниқлашга имконини
              беради.
              <br />
              <br />
              2.3. “Инвестор” қурилиш ҳудудининг ижтимоий, иқтисодий, экологик
              ҳолати ҳақида етарли маълумотларга эга эканлигини тасдиқлайди.
              <br />
              <br />
              2.4. “Инвестор” юқоридаги маълумотлар миқдори ўзи учун етарли
              эканлигини ва ушбу шартномани тузиш тўғрисида қарор қабул қилиш ва
              унинг инвестициялашдаги иштироки хавфини баҳолаш учун асос
              бўлганлигини тасдиқлайди ҳамда у унга инвестициялар бўйича ўз
              мажбуриятларини тўғри бажариш имконини бериши учун ўзининг жорий
              ва келажакдаги молиявий ҳолатини етарлича баҳолаган.
              <br />
              <br />
              2.5. “Инвестор” турар-жой мулкдорининг ҳуқуқни тасдиқловчи
              ҳужжатларини (ЎзР қонунчилигига мувофиқ тегишли кадастр ва бошқа
              ҳужжатларни) олгунига қадар у Инвестиция объектини қайта
              режалаштириш ва таъмирлаш ишларини амалга оширишга ҳақли эмас.
              <br />
              <br />
              2.6. “Инвестор” инвестиция объектига эгалик ҳуқуқи ўзига ўтган
              кундан бошлаб 6 (олти) ой ичида Ўзбекистон Республикасининг
              норматив-ҳуқуқий ҳужжатлари талабларига ҳамда техник, санитария ва
              архитектура хавфсизлиги талабларига жавоб берадиган,
            </p>
          </div>
          <div className="ContractPDF__footer">
            Инвестор ______________{" "}
            <span className="ContractPDF__spacer"></span> Қурувчи ______________
          </div>
        </div>
        <div className="ContractPDF__page">
          <div>
            <div className="page_num">-  4  -</div>
            <p className="ContractPDF__desc">
              бинога ўз маблағлари ҳисобига зарар етказмасдан иккинчи босқичдаги
              барча пардозлаш ва махсус монтаж ишларини бажариш, ва белгиланган
              тартибда ва муддатларда тегишли хизматлар билан объектни сақлаш
              бўйича коммунал (эксплуатация) ва бошқа хизматлар кўрсатиш бўйича
              шартномалар тузиш мажбуриятини олади.
            </p>
            <h2 className="ContractPDF__title">
              3. ТОМОНЛАРНИНГ ҲУҚУҚ ВА МАЖБУРИЯТЛАРИ
            </h2>
            <p className="ContractPDF__desc">
              3.1. “Инвестор”нинг ҳуқуқ ва мажбуриятлари:
              <br />
              <br />
              3.1.1. "Инвестор" қурилишга ўз инвестиция ҳиссасини тўлиқ ҳажмда
              ва ушбу шартномада белгиланган муддатларда киритиши шарт.
              <br />
              <br />
              3.1.2. "Инвестор" қурилишга пул маблағларини нақд пул шаклида
              киритишга мажбурдир.
              <br />
              <br />
              3.1.3. "Инвестор" Инвестиция объектини қабул қилиш-топшириш
              далолатномаси бўйича "Қурувчидан" турар-жой биноси қурилиши
              тугаганлиги ва Объектнинг ушбу шартномага мувофиқ ўтказишга
              тайёрлиги тўғрисида билдиришнома олинган пайтдан эътиборан 10 (ўн)
              календар кун ичида қабул қилишга мажбурдир. “Инвестор” томонидан
              ҳужжатлар билан тасдиқланган қабул қилиш муддати узрсиз сабабларга
              кўра бузилган тақдирда, “Қурувчи”нинг Объектни “Инвестор”га
              ўтказиш мажбурияти бажарилган ҳисобланади ва белгиланган муддатдан
              кейин тасодифий ўлим ва/ёки объектга зарар етказиш хавфи
              "Инвестор"га ўтади.
              <br />
              <br />
              3.1.4. “Инвестор” ўз номидан, шу жумладан кўчмас мулкка бўлган
              ҳуқуқларни давлат рўйхатидан ўтказиш бўйича ваколатли органларда
              нотариал рўйхатдан ўтказиш билан боғлиқ барча харажатларни ўз
              зиммасига олишга ва тўлашга мажбурдир.
              <br />
              <br />
              3.1.5. "Инвестор" техник (реконструкция қилмаслик, юк кўтарувчи
              деворларни бузмаслик), объектнинг, турар - жой биносининг ва унга
              туташ ҳудуднинг ёнғин ва санитария қоидалари ва фойдаланиш
              нормаларига риоя қилиши, турар-жой биносининг фасадини, майдони ва
              фойдаланиш мулкини ўзгартирмаслиги, кондиционерларни, ҳар хил
              турдаги антенналар, дудбўронлар, панжараларни ўрнатишда "Қурувчи"
              билан келишиши шарт. Инвестиция объектни сақлаш харажатларини
              қоплаш учун зарур бўлган харажатларни ўз вақтида тўлаши керак.
              <br />
              <br />
              3.1.6. “Инвестор” ўз реквизитлари (паспорт маълумотлари, манзили,
              жорий ҳисоб рақами, телефон рақамлари ва бошқалар) ўзгарганлиги
              тўғрисида “Қурувчи”ни ёзма равишда хабардор қилиши ва ўзгаришлар
              содир бўлган кундан бошлаб 7 кун ичида янги маълумотларни тақдим
              этиши шарт.
              <br />
              <br />
              3.1.7. “Инвестор” “Қурувчи”дан ушбу Шартномани амалга оширишнинг
              бориши тўғрисида маълумот олишга ҳақли.
              <br />
              <br />
              3.1.8. “Инвестор” шартномани бир томонлама бекор қилиш ва ўзи
              томонидан инвестиция депозити ҳисобварағига қўйилган маблағларни
              ушбу Шартномада назарда тутилган жарима ва пенялар чегириб
              ташланган ҳолда олишга ҳақли.
              <br />
              <br />
              3.2. “Қурувчи”нинг ҳуқуқ ва мажбуриятлари:
            </p>
          </div>
          <div className="ContractPDF__footer">
            Инвестор ______________{" "}
            <span className="ContractPDF__spacer"></span> Қурувчи ______________
          </div>
        </div>
        <div className="ContractPDF__page">
          <div>
            <div className="page_num">-  5  -</div>
            <p className="ContractPDF__desc">
              3.2.1. “Қурувчи” “Инвестор”нинг инвестиция ҳиссасидан ушбу
              Шартноманинг предметига мувофиқ мақсадли фойдаланишни таъминлаши
              шарт.
              <br />
              <br />
              3.2.2. “Қурувчи” турар жой биносини қуриш ва фойдаланишга
              топширишни лойиҳа-смета ҳужжатларига, шаҳарсозлик нормалари ва
              қоидаларига мувофиқ амалга ошириши шарт.
              <br />
              <br />
              3.2.3. "Қурувчи" белгиланган тартибда "Қурилиши тугалланган
              объектни қабул қилиш тўғрисидаги Давлат қабул комиссиясининг
              далолатномаси" тасдиқланган пайтдан эътиборан 30 кун ичида ушбу
              шартнома шартларига мувофиқ инвестиция ҳиссаси тўлиқ миқдорда
              киритилгандан сўнг объектни қабул қилиш-топширишга тайёрлиги
              тўғрисида "Инвесторга " хабарнома юбориши шарт.
              <br />
              <br />
              3.2.4. Объект фойдаланишга топширилгандан ва унга кадастр
              ҳужжатлари расмийлаштирилгандан кейин бир ой ичида "Қурувчи"
              "Инвестор"га ушбу шартноманинг 1.4-бандига мос келадиган объектни,
              агар “Инвестор” инвестиция ҳиссасини қўшиш бўйича ўз
              мажбуриятларини тўлиқ ва лозим даражада бажарган тақдирда; қабул
              қилиш ва топшириш далолатномаси бўйича топшириши, шунингдек
              "Инвестор"га унинг номига эгалик ҳуқуқини рўйхатдан ўтказиш учун
              барча зарур ҳужжатларни тақдим этиши шарт. Объект бўйича кадастр
              ҳужжатларини расмийлаштириш вақтида инвестиция ҳиссаси тўлиқ
              тўланмаган тақдирда, инвестиция объектини ўтказиш "Инвестор"
              томонидан инвестиция ҳиссаси тўлиқ тўланган кундан бошлаб 20
              (йигирма) кун ичида амалга оширилади.
              <br />
              <br />
              3.2.5. Агар бу объектив равишда шаҳарсозлик нормалари ва
              қоидаларининг қўшимча талабларини бажариш билан боғлиқ бўлса,
              "Қурувчи" турар-жой биносини қуришни якунлаш муддатларини бир
              томонлама ўзгартиришга ҳақли.
              <br />
              <br />
              3.2.6. "Қурувчи" "Инвестор" томонидан инвестиция ҳиссасини киритиш
              муддатлари бир томонлама тартибда бузилган тақдирда ушбу
              шартномани бекор қилиш ва "Инвестор" томонидан инвестиция ҳиссаси
              ҳисобига киритилган пул маблағларини ушбу шартномада назарда
              тутилган жарималар ва пенялар миқдорини олиб ташлаган ҳолда
              қайтариш ҳуқуқига эга. Бунда “Инвестор”га маблағларни қайтариш
              инвестиция депозити қайси шаклда амалга оширилганлигидан қатъий
              назар, “Инвестор” томонидан кўрсатилган банк ҳисобварағига нақд
              пулсиз шаклда амалга оширилади.
            </p>
            <h2 className="ContractPDF__title">
              4. ИНВЕСТИЦИЯ МИҚДОРИ ВА ҲИСОБ-КИТОБ ТАРТИБИ
            </h2>
            <p className="ContractPDF__desc">
              4.1. “Инвестор” томонидан инвестиция ҳиссаси сифатида
              киритиладиган инвестициялар суммаси{" "}
              <b>{formatmoney(shartnoma?.umumiy_summa)}</b>      (
              <b>{numberToUzbekWords(shartnoma?.umumiy_summa)}</b> ) сўмни
              ташкил этади. <br />
              <br /> 4.2. Инвестицион бадал миқдорини ҳисоблаш учун шартноманинг
              1.4-бандига мувофиқ яшаш хонадонининг умумий майдони ва яшаш
              хонадонининг (Инвестиция объекти) 1 м2 қиймати турар-жой биносини
              қуришда иштирок этиш учун инвестиция ҳиссасининг шартнома нархини
              келишиш протоколига мувофиқ белгиланади (ушбу Шартномага 1-илова)
              ва “Инвестор” ушбу Шартноманинг 2-иловасига (кейинги ўринларда
              Жадвал деб юритилади) биноан инвестиция ҳиссасини киритиш
              жадвалига мувофиқ ушбу
            </p>
          </div>
          <div className="ContractPDF__footer">
            Инвестор ______________{" "}
            <span className="ContractPDF__spacer"></span> Қурувчи ______________
          </div>
        </div>
        <div className="ContractPDF__page">
          <div className="ContractPDF__footer">
            Инвестор ______________{" "}
            <span className="ContractPDF__spacer"></span> Қурувчи ______________
          </div>
        </div>
        <div className="ContractPDF__page">
          <div className="ContractPDF__footer">
            Инвестор ______________{" "}
            <span className="ContractPDF__spacer"></span> Қурувчи ______________
          </div>
        </div>
        <div className="ContractPDF__page">
          <div className="ContractPDF__footer">
            Инвестор ______________{" "}
            <span className="ContractPDF__spacer"></span> Қурувчи ______________
          </div>
        </div>
        <div className="ContractPDF__page">
          <div className="ContractPDF__footer">
            Инвестор ______________{" "}
            <span className="ContractPDF__spacer"></span> Қурувчи ______________
          </div>
        </div>
        <div className="ContractPDF__page">
          <div className="ContractPDF__footer">
            Инвестор ______________{" "}
            <span className="ContractPDF__spacer"></span> Қурувчи ______________
          </div>
        </div>
        <div className="ContractPDF__page">
          <div className="ContractPDF__footer">
            Инвестор ______________{" "}
            <span className="ContractPDF__spacer"></span> Қурувчи ______________
          </div>
        </div>
      </div>
    </div>
  );
};
